[A_Blizzard_Buff_Marker H7BaseBuff]
mName="暴雪肆虐"

[A_DeepFreeze_Buff H7BaseBuff]
mName="深度冻结"
mTooltip="%stat 移动力 和 %stat.icon\n持续 %durnow 回合。"

[A_LiquidMembrane_Buff_3_Master_Improved H7BaseBuff]
mName="流水护膜"
mTooltip="对该生物造成的所有伤害减少 %res.norm。\n%stat %stat.icon 移动力\n持续 %durnow 回合。"

[Imprinted.A_Blizzard_Imprinted_Buff_Marker H7BaseBuff]
mName="暴雪肆虐"

[Imprinted.A_CircleOfWinter_Imprinted H7HeroAbility]
mName="严冬冰环"
mTooltip="立即对目标圆形3x3区域内的所有单位造成 %d.min 到 %d.max %d.icon 水系伤害。"

[A_VesselOfShalassa H7HeroAbility]
mName="水龙之舟"
mTooltip="立即在附近水域召唤一艘船。"

[A_FreezingOrb_Obstacle_1_Novice H7CombatObstacleObject]
mObstacleName="冰冻之球"

[A_LiquidMembrane_Buff_2_Expert_Improved H7BaseBuff]
mName="流水护膜"
mTooltip="对该生物造成的所有伤害减少 %res.norm。\n%stat %stat.icon 移动力\n持续 %durnow 回合。"

[A_LiquidMembrane_Buff_1_Novice H7BaseBuff]
mName="流水护膜"
mTooltip="对该生物造成的所有伤害减少 %res.norm。\n持续 %durnow 回合。"

[Imprinted.A_Blizzard_Imprinted H7HeroAbility]
mName="暴雪肆虐"
mTooltip="在目标4x4区域制造暴雪，持续 %durini 战斗回合。在其回合开始时位于其中的生物，其 %buff.buff.buff.buff.stat.icon 移动力降低 %buff.buff.buff.buff.stat.norm，直到其回合结束。\n（冷却时间：4回合）"

[A_Blizzard_Buff H7BaseBuff]
mName="暴雪肆虐"
mTooltip="%stat %stat.icon 移动力\n持续 %durnow 回合。"

[A_FogShroud H7HeroAbility]
mTooltipMagicGuild="目标生物无法被远程攻击选中，并且无法进行远程攻击或使用激活技能，持续 %buff1.buff.durini 回合或直到它受到伤害。"
mTooltipMagicGuildRankLine="%special1 %ICON_MANA 法力消耗"
mTooltipUpgraded="目标生物无法被远程攻击选中，并且无法进行远程攻击或使用激活技能，持续 %buff2.buff.durini 回合。"
mName="迷雾重重"
mTooltip="目标生物无法被远程攻击选中，并且无法进行远程攻击或使用激活技能，持续 %buff1.buff.durini 回合或直到它受到伤害。"

[A_FreezingOrb_Obstacle_3_Master H7CombatObstacleObject]
mObstacleName="冰冻之球"

[A_LiquidMembrane_Buff_0_Unskilled H7BaseBuff]
mName="流水护膜"
mTooltip="对该生物造成的所有伤害减少 %res.norm。\n持续 %durnow 回合。"

[A_Blizzard H7HeroAbility]
mTooltipMagicGuild="在目标4x4区域制造暴雪，持续 %durini 战斗回合。在其回合开始时位于其中的生物，其 %buff.buff.buff.buff.stat.icon 移动力降低，直到其回合结束。\n（冷却时间：4回合）"
mTooltipMagicGuildRankLine="%buff.buff.buff.buff.stat %buff.buff.buff.buff.stat.icon 移动力"
mTooltipUpgraded="在目标4x4区域制造暴雪，持续 %durini 战斗回合。在其回合开始时位于其中的生物，其 %buff.buff.buff.buff.stat.icon 移动力降低 %buff.buff.buff.buff.stat.norm，持续 %buff.buff.buff.buff.durini2 回合。\n（冷却时间：4回合）"
mName="暴雪肆虐"
mTooltip="在目标4x4区域制造暴雪，持续 %durini 战斗回合。在其回合开始时位于其中的生物，其 %buff.buff.buff.buff.stat.icon 移动力降低 %buff.buff.buff.buff.stat.norm，直到其回合结束。\n（冷却时间：4回合）"

[A_Burningdetermination H7HeroAbility]
mTooltipMagicGuild="在多个回合内减少对目标友方生物的任何伤害。"
mTooltipMagicGuildRankLine="%buff1.buff.res.norm 伤害减免"
mTooltipUpgraded="减少对目标友方生物的任何伤害 %buff2.buff.res.norm，并提升其 %buff2.buff.stat.icon 移动力 %buff2.buff.stat.norm，持续 %buff2.buff.durini 回合。"
mName="流水护膜"
mTooltip="减少对目标友方生物的任何伤害 %buff1.buff.res.norm，持续 %buff1.buff.durini 回合。"

[A_LiquidMembrane_Buff_2_Expert H7BaseBuff]
mName="流水护膜"
mTooltip="对该生物造成的所有伤害减少 %res.norm。\n持续 %durnow 回合。"

[Imprinted.A_Blizzard_Imprinted_Buff H7BaseBuff]
mName="暴雪肆虐"
mTooltip="%stat %stat.icon 移动力\n持续 %durnow 回合。"

[A_IceStrike_Buff_Upgraded H7BaseBuff]
mName="凝冰之击"
mTooltip="该生物攻击时造成额外 %d.min 到 %d.max %d.icon 水系伤害，并且被攻击的生物获得 %buff1.buff.stat %buff1.buff.stat.icon 移动力，持续 %buff1.buff.durini 回合。\n持续 %durnow 回合。"

[A_FreezingOrb_Obstacle_2_Expert H7CombatObstacleObject]
mObstacleName="冰冻之球"

[A_FreezingOrb_Obstacle_0_Unskilled H7CombatObstacleObject]
mObstacleName="冰冻之球"

[A_FogShroud_Buff_Positive_Upgraded H7BaseBuff]
mName="迷雾重重"
mTooltip="该生物不能被选为远程攻击的目标。它无法进行远程攻击或使用激活技能。\n持续 %durnow 回合。"

[A_LiquidMembrane_Buff_3_Master H7BaseBuff]
mName="流水护膜"
mTooltip="对该生物造成的所有伤害减少 %res.norm。\n持续 %durnow 回合。"

[A_FogShroud_Buff_Positive H7BaseBuff]
mName="迷雾重重"
mTooltip="该生物不能被选为远程攻击的目标。它无法进行远程攻击或使用激活技能。\n持续 %durnow 回合或直到该生物受到伤害。"

[Imprinted.A_FogShroud_Imprinted_Buff_Negative H7BaseBuff]
mName="迷雾重重"
mTooltip="目标生物不能被选为远程攻击的目标。它无法进行远程攻击或使用激活技能。\n持续 %durnow 回合或直到该生物受到伤害。"

[Imprinted.A_FogShroud_Imprinted H7HeroAbility]
mName="迷雾重重"
mTooltip="目标生物不能被远程攻击选中，并且无法进行远程攻击或使用激活技能，持续 %buff1.buff.durini 回合或直到它受到伤害。"

[Imprinted.A_FreezingOrb_Imprinted H7HeroAbility]
mName="冰冻之球"
mTooltip="在目标空地上召唤一个1x1的冰冻之球，拥有 %special.val1 点生命值。它持续到接下来2个战斗回合结束或被摧毁为止。在每个战斗回合结束时，冰冻之球会穿过任何障碍移动到距离敌方生物最远的空地上。它散发一个3x3的光环，对敌方生物造成 %special.val2 到 %special.val3 %icon_water 水系伤害，并且它们获得 %buff.buff.stat %buff.buff.stat.icon 移动力，持续 %buff.buff.durini 回合。"

[Imprinted.A_FogShroud_Imprinted_Buff_Positive H7BaseBuff]
mName="迷雾重重"
mTooltip="目标生物不能被选为远程攻击的目标。它无法进行远程攻击或使用激活技能。\n持续 %durnow 回合或直到该生物受到伤害。"

[A_FogShroud_Buff_Negative_Upgraded H7BaseBuff]
mName="迷雾重重"
mTooltip="该生物不能被选为远程攻击的目标。它无法进行远程攻击或使用激活技能。\n持续 %durnow 回合。"

[A_FogShroud_Buff_Negative H7BaseBuff]
mName="迷雾重重"
mTooltip="该生物不能被选为远程攻击的目标。它无法进行远程攻击或使用激活技能。\n持续 %durnow 回合或直到该生物受到伤害。"

[A_FrostBolt H7HeroAbility]
mTooltipMagicGuild="立即对目标敌方单位造成 %d.icon 水系伤害。"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %d.icon"
mTooltipUpgraded="立即对目标敌方单位造成 %d.min 到 %d.max %d.icon 水系伤害，并且其 %buff.buff.stat.icon 移动力降低 %buff.buff.stat.norm，持续 %buff.buff.durini 回合。"
mName="霜冻箭矢"
mTooltip="立即对目标敌方单位造成 %d.min 到 %d.max %d.icon 水系伤害。"

[A_IceStrike_Buff H7BaseBuff]
mName="凝冰之击"
mTooltip="该生物攻击时造成额外 %d.min 到 %d.max %d.icon 水系伤害。\n持续 %durnow 回合。"

[Imprinted.A_FreezingOrb_Imprinted_Obstacle H7CombatObstacleObject]
mObstacleName="冰冻之球"

[Imprinted.A_FrostBolt_Imprinted H7HeroAbility]
mName="霜冻箭矢"
mTooltip="立即对目标敌方单位造成 %d.min 到 %d.max %d.icon 水系伤害。"

[Imprinted.A_IceStrike_Imprinted H7HeroAbility]
mName="凝冰之击"
mTooltip="目标友方生物攻击时造成额外 %buff.buff.d.min 到 %buff.buff.d.max %buff.buff.d.icon 水系伤害。持续 %buff.buff.durini 回合。"

[Imprinted.A_IceStrike_Imprinted_Buff H7BaseBuff]
mName="凝冰之击"
mTooltip="该生物攻击时造成额外 %d.min 到 %d.max %d.icon 水系伤害。\n持续 %durnow 回合。"

[Imprinted.A_LiquidMembrane_Imprinted H7HeroAbility]
mName="流水护膜"
mTooltip="减少对目标友方生物的任何伤害 %buff1.buff.res.norm，持续 %buff1.buff.durini 回合。"

[Imprinted.A_Tsunami_Imprinted H7HeroAbility]
mName="巨浪海啸"
mTooltip="立即对目标区域内的所有单位造成 %d.min 到 %d.max %d.icon 水系伤害，并将小型生物向后推2格。目标区域横跨5列。\n（冷却时间：4回合）"

[Imprinted.A_VesselOfShalassa_Imprinted H7HeroAbility]
mName="水龙之舟"
mTooltip="在附近水域召唤一艘船。"

[A_FogShroud_Buff H7BaseBuff]
mName="迷雾重重"
mTooltip="该生物不能被选为远程攻击的目标。它无法进行远程攻击或使用激活技能。\n持续 %durnow 回合或直到该生物受到伤害。"
[Imprinted.A_FogShroud_Imprinted_Buff H7BaseBuff]
mName="迷雾重重"
mTooltip="目标生物不能被选为远程攻击的目标。它无法进行远程攻击或使用激活技能。\n持续 %durnow 回合或直到该生物受到伤害。"
[A_FogShroud_Buff_Upgraded H7BaseBuff]
mName="迷雾重重"
mTooltip="该生物不能被选为远程攻击的目标。它无法进行远程攻击或使用激活技能。\n持续 %durnow 回合。"

7.5_mod : 


[A_Burningdetermination H7HeroAbility]
mTooltipMagicGuild="在多个回合内减少对目标友方生物的任何伤害。"
mTooltipMagicGuildRankLine="%buff1.buff.res.norm 伤害减免"
mTooltipUpgraded="减少对目标友方生物的任何伤害 %buff2.buff.res.norm，并提升其 %buff2.buff.stat.icon 移动力 %buff2.buff.stat.norm，持续 %buff2.buff.durini 回合。"
mName="流水护膜"
mTooltip="减少对目标友方生物的任何伤害 %buff1.buff.res.norm，持续 %buff1.buff.durini 回合。"

v1.33

[Anti_heal.A_Nova H7HeroAbility]
mTooltipMagicGuild="目标生物无法再接受治疗或被治愈。（对构造体类型单位无效）"
mTooltipMagicGuildRankLine="造成 %d %icon_water。目标4x4区域内的生物在 %buff1.buff.durini 回合内无法接受治疗或被治愈。对构造体类型单位无效。"
mTooltipUpgraded="造成 %d %icon_water。目标4x4区域内的生物在 %buff1.buff.durini 回合内无法被治疗或治愈。对构造体单位无效。"
mName="疗愈冻结"
mTooltip="造成 %d %icon_water 伤害。该生物在 %buff1.buff.durini 回合内无法被治疗。（对构造体类型单位无效）"

[Armure_de_givre.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild="提升目标盟友的防御，并有50%几率冻结近战攻击它的敌人。"
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="提升4x4区域内目标盟友的防御 %buff1.buff.stat1 %icon_defense，并有50%几率冻结近战攻击它的敌人，持续 %buff1.buff.durini.norm 回合。"
mName="寒冰护甲"
mTooltip="提升目标盟友的防御 %buff1.buff.stat1，并有50%几率冻结近战攻击它的敌人，持续 %buff1.buff.durini.norm 回合。"

v1.35

[reworks.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild="目标友方生物攻击时造成额外 %buff1.buff.d.icon 水系伤害。持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%buff1.buff.d.min 到 %buff1.buff.d.max %ICON_WATER"
mTooltipUpgraded="目标友方生物攻击时造成额外 %buff2.buff.d.min 到 %buff2.buff.d.max %buff2.buff.d.icon 水系伤害，并且被攻击的生物获得 %buff2.buff.buff1.buff.stat %buff2.buff.buff1.buff.stat.icon 移动力，持续 %buff2.buff.buff1.buff.durini 回合。持续 %buff2.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）。"
mName="凝冰之击"
mTooltip="目标友方生物攻击时造成额外 %buff1.buff.d.min 到 %buff1.buff.d.max %buff1.buff.d.icon 水系伤害。持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）。"

[New_orbre.A_dammage_orbre_unskill_Buff H7BaseBuff]
mName="霜寒光环"
mTooltip="对相邻单位造成 %d.min 到 %d.max %icon_water 伤害，并对受影响单位施加 %spell1.name。"

[New_orbre.orbre_creature_expert H7Creature]
mName="冰冻之球 III"
mLore=""

[New_orbre.orbre_creature_master H7Creature]
mName="冰冻之球 IV"
mLore=""

[New_orbre.orbre_creature_novice H7Creature]
mName="冰冻之球 II"
mLore=""

[New_orbre.orbre_creature_unskill H7Creature]
mName="冰冻之球"
mLore=""

v1.37

[A_Tsunami H7HeroAbility]
mTooltipMagicGuild="立即对目标区域内的所有单位造成 %d.icon 水系伤害，并将小型生物向后推2格。目标区域横跨5列。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %ICON_WATER"
mName="巨浪海啸"
mTooltip="立即对目标区域内的所有单位造成 %d.min 到 %d.max %d.icon 水系伤害，并将小型生物向后推2格。目标区域横跨5列。\n（冷却时间：%buff9.buff.durini 回合）\n如果英雄拥有超过12点 %icon_ARCANE_KNOWLEDGE 奥术知识，则冷却时间变为：%buff8.buff.durini 回合。"


[A_FreezingOrb H7HeroAbility]
mTooltipMagicGuild="在目标空地上召唤一个冰冻之球，拥有 500%icon_health + 250%icon_health （每级水系掌握）%icon_water 生命值，持续直到被摧毁。\n它在回合结束时对相邻的敌方生物造成水系伤害。它们还会获得 %buff2.buff.buff.buff.stat 移动力 %icon_movement，持续 %buff2.buff.buff.buff.durini 回合。"
mTooltipMagicGuildRankLine="500 %icon_health + 每级掌握 250%icon_health。光环造成 %buff2.buff.d.min 到 %buff2.buff.d.max %icon_water 水系伤害。"
mName="冰冻之球"
mTooltip="在目标空地上召唤一个冰冻之球，拥有 500%icon_health + 250%icon_health （每级水系掌握）%icon_water 生命值，持续直到被摧毁。\n它在回合结束时对相邻的敌方生物造成水系伤害。它们还会获得 %buff2.buff.buff.buff.stat 移动力 %icon_movement，持续 %buff2.buff.buff.buff.durini 回合。\n冷却时间：%buff9.buff.durini 回合。\n如果英雄拥有超过12点 %icon_ARCANE_KNOWLEDGE 奥术知识，则冷却时间变为：%buff8.buff.durini 回合。"


[A_Nova H7HeroAbility]
mTooltipMagicGuild="对4x4区域造成 %d %icon_water 水系伤害，被击中的生物失去 %buff1.buff.stat.norm %icon_movement 移动力，并在 %buff1.buff.durini1 回合内从每个来源受到 %buff1.buff.res.norm 额外伤害。如果法术以大师等级施放，区域变为6x6。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%buff.buff.buff.buff.stat %buff.buff.buff.buff.stat.icon 移动力"
mTooltipUpgraded="对4x4区域造成 %d %icon_water 水系伤害，被击中的生物失去 %buff1.buff.stat1.norm %icon_movement 移动力，并在 %buff1.buff.durini2 回合内从每个来源受到 %buff1.buff.res.norm 额外伤害。如果法术以大师等级施放，区域变为6x6。\n（冷却时间：%buff9.buff.durini 回合）"
mName="暴雪肆虐"
mTooltip="对4x4区域造成 %d %icon_water 水系伤害，被击中的生物失去 %buff1.buff.stat1.norm %icon_movement 移动力，并在 %buff1.buff.durini1 回合内从每个来源受到 %buff1.buff.res.norm 额外伤害。如果法术以大师等级施放，区域变为6x6。\n（冷却时间：%buff9.buff.durini 回合）"

[A_Blizzard_new_Buff H7BaseBuff]
mName="暴雪肆虐"
mTooltip="移动力降低 %stat1.norm %stat1.icon，并且该生物在 %durnow 回合内从所有来源受到 %res 额外伤害。"

v1.38

[reworks.A_Nova H7HeroAbility]
mTooltipMagicGuild="立即对目标圆形3x3区域内的所有单位造成 %d.icon 水系伤害。\n（冷却时间：%buff9.buff.durini 回合）。"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %d.icon"
mTooltipUpgraded="立即对目标圆形3x3区域内的所有单位造成 %d.min 到 %d.max %d.icon 水系伤害。所有受影响的生物获得 %buff1.buff.stat %buff1.buff.stat.icon 移动力，持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"
mName="严冬冰环"
mTooltip="立即对目标圆形3x3区域内的所有单位造成 %d.min 到 %d.max %d.icon 水系伤害。\n（冷却时间：%buff9.buff.durini 回合）。"

[Water_heal.A_Regeneration H7HeroAbility]
mTooltipMagicGuild="立即轻微治疗并复活目标友方生物，然后在2回合内治疗目标。"
mTooltipMagicGuildRankLine="%d1.min 生命值"
mTooltipUpgraded="立即治疗目标3x3区域内友方生物 %d1.min %icon_health 生命值，然后在 %buff1.buff.durini 回合内治疗 %buff1.buff.d.min %icon_health 生命值。"
mName="疗愈之泉"
mTooltip="立即治疗目标友方生物 %d1.min %icon_health 生命值，然后在 %buff1.buff.durini 回合内治疗 %buff1.buff.d1.min %icon_health 生命值。（如果英雄拥有 %spell5.name，此法术将在3x3区域施放。）"